# 列表切片  （元组/字符串切片同理）取数不包括结束索引位置元素
list1 = [10,20,30,40,50,60,70,80,90,100]
# 起始索引：0   结束索引：5  一位一位的取数据
list2 = list1[0:5:1]
print(list2)
# 起始索引：1   结束索引：10 跳过一位的取数
list3 = list1[1:10:2]
print(list3)
# 起始索引：1  结束索引10  跳过两位的取数
list4 = list1[1:10:3]
print(list4)
# 默认起始索引为0，结束索引为容器长度，默认一位一位的取数
list5 = list1[::]
print(list5)
# 起始索引为7  > 结束索引为2 步长为负数（正数取不到数据）
# 此时是从索引为7的数往索引为2的数，跳过两位的取数
list6 = list1[7:2:-3]
print(list6)
# 特殊情况：当同时省略起始索引和结束索引时，如果步长为负数那么python会自动对调，起始索引是容器长度，结束索引是0
list7 = list1[::-1]
print(list7)

print()

# 序列相加 (列表/字符串同理)
# 相加时，只能同类型的序列才能相加
tuple1 = (100, 200, 300)
tuple2 = (400, 500, 600)
tuple3 = tuple2 + tuple1
print(tuple3)

print()


# 序列相乘（重复）(列表/字符串同理)
str1 = 'hello!'
# 将str1中的元素重复3次
str2 = str1 * 3
print(str2)
